# -*- coding: utf-8 -*-
"""
運算子:
    +
    -
    *
    /  顯示小數點3/2=1.5
    // 取商數3//2=1
    %  取餘數3%2
    ** 平方     
比較運算子:
    ==
    !=
    >
    >=
    <
    <=
    回應boolean值:True或False
邏輯運算子:
    and
    or
    not
    
"""
#=======================================
r=5;
scircle=r*r*3.14159;
#以 ',' 逗號串接
print("小圓面積:",scircle);
#=======================================
#end為結尾預設是\n
print("hello",end='');
print("wei",end='\n');
#sep為間隔預設是空
print(10,20,30,sep='#');
#=======================================
a=6
b=3     
print(a==b and a==b*2)      
